xml/AirPricingReq.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header/>
<soapenv:Body>
<AirPriceReq xmlns="http://www.travelport.com/schema/air_v36_0" TraceId="63ad216d-145f-49fe-827c-54c8e9451698"
 AuthorizedBy="Chetan" TargetBranch="P7030029">
  <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v36_0" OriginApplication="uAPI"
 />
  <AirItinerary>
    <AirSegment Key="K8DG2cOSQEy4aT9yPorcUg==" AvailabilitySource="A" Equipment="738" AvailabilityDisplayType
="{ToAvailabilityDisplayType}" Group="0" Carrier="AF" FlightNumber="5064" Origin="CDG" Destination="VLC"
 DepartureTime="2016-10-21T16:15:00.000+02:00" ArrivalTime="2016-10-21T18:10:00.000+02:00" FlightTime
="115" Distance="675" ProviderCode="1G" >
      <CodeshareInfo OperatingCarrier="I2" />
    </AirSegment>
    <AirSegment Key="tfmG0H4gTO6RxWYLOrDVmA==" AvailabilitySource="A" Equipment="738" AvailabilityDisplayType
="Fare Shop/Optimal Shop" Group="1" Carrier="AF" FlightNumber="5059" Origin="VLC" Destination="CDG" DepartureTime
="2016-10-23T07:05:00.000+02:00" ArrivalTime="2016-10-23T09:15:00.000+02:00" FlightTime="130" Distance
="675" ProviderCode="1G" ClassOfService="P">
      <CodeshareInfo OperatingCarrier="I2" />
    </AirSegment>
  </AirItinerary>
  <AirPricingModifiers InventoryRequestType="DirectAccess">
    <BrandModifiers ModifierType="FareFamilyDisplay" />
  </AirPricingModifiers>
  <SearchPassenger xmlns="http://www.travelport.com/schema/common_v36_0" Code="ADT" Age="40" BookingTravelerRef
="SzBXZHdFSnBYRHRlREhkRA==" Key="SzBXZHdFSnBYRHRlREhkRA==" />
  <AirPricingCommand>
    
    
  </AirPricingCommand>
  <FormOfPayment xmlns="http://www.travelport.com/schema/common_v36_0" Type="Credit" />
</AirPriceReq>
</soapenv:Body>
</soapenv:Envelope>
